app/views/events/edit.html.erb


          <%= f.input :club_id, collection: [[@event.club_id, Club.find(@event.club_id).name]], label_method: :second, value_method: :first, disabled: true %>
---
SELECT  "clubs".* FROM "clubs" WHERE "clubs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

            <div class="form-group col-sm-4">
              <% Category.all.each_with_index do |categorie, i| %>
---
SELECT  "categories".* FROM "categories" ORDER BY "categories"."id" ASC LIMIT $1  [["LIMIT", 1]]