app/views/pages/home.html.erb

SELECT "clubs".* FROM "clubs"
---
              data-style="btn-default">
              <% Club.all.each do |club| %>

SELECT  "categories".* FROM "categories" ORDER BY "categories"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
          <div class="form-group col-sm-4">
            <%= "<div class='radio'><label><input type='radio' name='category_id' value='#{Category.first.id}' required>&nbsp;#{@categories[0]}</label></div>".html_safe %>
            <%= "<div class='radio'><label><input type='radio' name='category_id' value='#{Category.first.id+1}'>&nbsp;#{@categories[1]}</label></div>".html_safe %>
            <%= "<div class='radio'><label><input type='radio' name='category_id' value='#{Category.first.id+2}'>&nbsp;#{@categories[2]}</label></div>".html_safe %>
            <%= "<div class='radio'><label><input type='radio' name='category_id' value='#{Category.first.id+3}'>&nbsp;#{@categories[3]}</label></div>".html_safe %>

SELECT  "categories".* FROM "categories" ORDER BY "categories"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
          <div class="form-group col-sm-4">
            <%= "<div class='radio'><label><input type='radio' name='category_id' value='#{Category.first.id+4}'>&nbsp;#{@categories[4]}</label></div>".html_safe %>
            <%= "<div class='radio'><label><input type='radio' name='category_id' value='#{Category.first.id+5}'>&nbsp;#{@categories[5]}</label></div>".html_safe %>
            <%= "<div class='radio'><label><input type='radio' name='category_id' value='#{Category.first.id+6}'>&nbsp;#{@categories[6]}</label></div>".html_safe %>
            <%= "<div class='radio'><label><input type='radio' name='category_id' value='#{Category.first.id+7}'>&nbsp;#{@categories[7]}</label></div>".html_safe %>

SELECT "events".* FROM "events"
---
  <!-- Events tables for showing the result -->
  <% Event.all.each do |event| %>

SELECT  "clubs".* FROM "clubs" WHERE "clubs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
      <div class="grid-border">
        <%= Club.find(event.club_id).name %>

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      <div class="grid-border">
        <%= "#{t 'underShortened'}#{Category.find(event.category_id).age} #{Category.find(event.category_id).level}#{Category.find(event.category_id).gender.capitalize if Category.find(event.category_id).gender == 'girls'}".strip %>