app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)
    @event.user = current_user
    @event.is_tournament_open = true
    if @event.save
---
INSERT INTO "events" ("date", "start_time", "places_left", "location", "contact", "is_tournament_open", "is_outdoor", "other_informations", "club_id", "user_id", "category_id", "created_at", "updated_at", "period") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"

  def edit
    @categories = []
    Category.all.each do |category|
---
SELECT "categories".* FROM "categories"

  def update
    @event.date = Time.new(params[:event]["date(1i)"], params[:event]["date(2i)"], params[:event]["date(3i)"]).strftime("%F")
    @event.period = params[:event][:period]
    @event.start_time = Time.new(2000, 1, 1, params[:event]["start_time(4i)"], params[:event]["start_time(5i)"]).strftime("%H:%M")
    @event.places_left = params[:event][:places_left]
    @event.location = params[:event][:location]
    @event.contact = params[:event][:contact]
    @event.is_tournament_open = params[:event][:is_tournament_open]
    @event.is_outdoor = params[:event][:is_outdoor]
    @event.other_informations = params[:event][:other_informations]
    @event.user = current_user
    @event.category = Category.find(params[:event][:category_id])

    if @event.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "events" SET "is_tournament_open" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["is_tournament_open", false], ["updated_at", "2019-06-24 21:21:18.703299"], ["id", 1]]