app/controllers/pages_controller.rb

SELECT  "clubs".* FROM "clubs" WHERE "clubs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "categories".* FROM "categories"
---
  def home
    if user_signed_in?
      @location = Club.find(current_user.club_id).field_address

      @contact = "#{current_user.first_name} #{current_user.last_name}, #{current_user.phone_number}, #{current_user.email}"
    end

    @categories = []
    Category.all.each do |category|